### Groupby, group rows together and aggregate

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Company': ['GOOG','GOOG','AAPL','AAPL','GME','GME'],
       'Person': ['Billy','Sam','Mike','Ben','Charlie','Jack'],
       'Sales': [100,150,405,380,240,310]}

In [3]:
data

{'Company': ['GOOG', 'GOOG', 'AAPL', 'AAPL', 'GME', 'GME'],
 'Person': ['Billy', 'Sam', 'Mike', 'Ben', 'Charlie', 'Jack'],
 'Sales': [100, 150, 405, 380, 240, 310]}

In [9]:
df = pd.DataFrame(data)

In [10]:
df

  Company   Person  Sales
0    GOOG    Billy    100
1    GOOG      Sam    150
2    AAPL     Mike    405
3    AAPL      Ben    380
4     GME  Charlie    240
5     GME     Jack    310

In [7]:
byCompany = df.groupby('Company')

In [8]:
byCompany.mean()

         Sales
Company
AAPL     392.5
GME      275.0
GOOG     125.0

In [11]:
byCompany.sum()

         Sales
Company
AAPL       785
GME        550
GOOG       250

In [13]:
byCompany.std()

             Sales
Company
AAPL     17.677670
GME      49.497475
GOOG     35.355339

In [15]:
byCompany.sum().loc['GME']

Sales    550
Name: GME, dtype: int64

In [16]:
df.groupby('Company').count()

         Person  Sales
Company
AAPL          2      2
GME           2      2
GOOG          2      2

In [17]:
df.groupby('Company').max()

        Person  Sales
Company
AAPL      Mike    405
GME       Jack    310
GOOG       Sam    150

In [18]:
df.groupby('Company').min()

          Person  Sales
Company
AAPL         Ben    380
GME      Charlie    240
GOOG       Billy    100

In [20]:
df.groupby('Company').describe().transpose()

Company           AAPL         GME        GOOG
Sales count    2.00000    2.000000    2.000000
      mean   392.50000  275.000000  125.000000
      std     17.67767   49.497475   35.355339
      min    380.00000  240.000000  100.000000
      25%    386.25000  257.500000  112.500000
      50%    392.50000  275.000000  125.000000
      75%    398.75000  292.500000  137.500000
      max    405.00000  310.000000  150.000000

In [22]:
df.groupby('Company').describe().loc['GOOG']

Sales  count      2.000000
       mean     125.000000
       std       35.355339
       min      100.000000
       25%      112.500000
       50%      125.000000
       75%      137.500000
       max      150.000000
Name: GOOG, dtype: float64